20240511T103303--kdoc-171-pdf本棚を作る__draft_code.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-05-19 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>KDOC 171: PDF本棚を作る</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='shortcut icon' type='image/x-icon' href='/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css' /><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">KDOC 171: PDF本棚を作る</h1>

<div id="outline-container-orgfabfa37" class="outline-2">
<h2 id="orgfabfa37"><a href="#orgfabfa37">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-orgfabfa37">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-05-13 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="off"><input type='checkbox' /> &lt;署名&gt;</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org4b6c6dc" class="outline-2">
<h2 id="org4b6c6dc"><a href="#org4b6c6dc">概要</a></h2>
<div class="outline-text-2" id="text-org4b6c6dc">
<p>
本はPDFで買うようにしている。いい感じにブラウザでPDFを一覧表示して読み始めるためのコードを書いた。
</p>

<ul class="org-ul">
<li>リポジトリ: <a href="https://github.com/kijimaD/shelf">shelf</a></li>
<li>設定の実例: <a href="https://github.com/kijimaD/mypdfs">mypdfs</a></li>
</ul>
</div>
</div>

<div id="outline-container-org19a8d8d" class="outline-2">
<h2 id="org19a8d8d"><a href="#org19a8d8d">関連</a></h2>
<div class="outline-text-2" id="text-org19a8d8d">
<ul class="org-ul">
<li><a href="20240324T120408--kdoc-127-chromeのpdfビューワでしおりを使う__essay.html#ID-20240324T120408">KDOC 127: ChromeのPDFビューワでしおりを使う</a>。背景</li>
<li><a href="20240511T041838--kdoc-170-pdfしおりを使いやすくする__draft_code.html#ID-20240511T041838">KDOC 170: しおりを自動化した</a>。この機能を含めた</li>
</ul>
</div>
</div>

<div id="outline-container-org9ae26eb" class="outline-2">
<h2 id="org9ae26eb"><a href="#org9ae26eb">Tasks</a></h2>
<div class="outline-text-2" id="text-org9ae26eb">
</div>
<div id="outline-container-orgc8f02df" class="outline-3">
<h3 id="orgc8f02df"><a href="#orgc8f02df"><span class="todo TODO">TODO</span> タイトル検索できるようにする</a></h3>
<div class="outline-text-3" id="text-orgc8f02df">
<p>
検索する。
</p>
</div>
</div>
<div id="outline-container-org7969460" class="outline-3">
<h3 id="org7969460"><a href="#org7969460"><span class="todo TODO">TODO</span> 偶然IDフォーマットが一致することがある</a></h3>
<div class="outline-text-3" id="text-org7969460">
<p>
文字数だけしか見てないから、たまに一致する。修正する。
</p>
</div>
</div>
<div id="outline-container-org823929c" class="outline-3">
<h3 id="org823929c"><a href="#org823929c"><span class="todo TODO">TODO</span> 表示数をいじれるようにする</a></h3>
<div class="outline-text-3" id="text-org823929c">
<p>
URLは受け取れるが、まだボタンがない。
</p>
</div>
</div>
<div id="outline-container-orge07cfa4" class="outline-3">
<h3 id="orge07cfa4"><a href="#orge07cfa4"><span class="todo TODO">TODO</span> オフライン時に表示がおかしい</a></h3>
<div class="outline-text-3" id="text-orge07cfa4">
<p>
tailwindがダウンロードできてないから。これもコードに入れてしまう。
</p>
</div>
</div>
</div>
<div id="outline-container-orgf099538" class="outline-2">
<h2 id="orgf099538"><a href="#orgf099538">Archive</a></h2>
<div class="outline-text-2" id="text-orgf099538">
</div>
<div id="outline-container-org262448a" class="outline-3">
<h3 id="org262448a"><a href="#org262448a"><span class="done DONE">DONE</span> 設定ファイルが乱立して扱いが面倒</a></h3>
<div class="outline-text-3" id="text-org262448a">
<p>
1ファイルにしたほうがよさそう。
</p>
</div>
</div>
<div id="outline-container-org74d5135" class="outline-3">
<h3 id="org74d5135"><a href="#org74d5135"><span class="done DONE">DONE</span> pdfjsリンクを追加する</a></h3>
<div class="outline-text-3" id="text-org74d5135">
<p>
リンクを追加する。
</p>
</div>
</div>
<div id="outline-container-orgfb9875a" class="outline-3">
<h3 id="orgfb9875a"><a href="#orgfb9875a"><span class="done DONE">DONE</span> タグをエントリにも表示する</a></h3>
<div class="outline-text-3" id="text-orgfb9875a">
<p>
今はボタンしか表示してないので、個別の本にも表示する。
</p>
</div>
</div>
<div id="outline-container-orgdb4b727" class="outline-3">
<h3 id="orgdb4b727"><a href="#orgdb4b727"><span class="done DONE">DONE</span> リンクを設定化する</a></h3>
<div class="outline-text-3" id="text-orgdb4b727">
<p>
相対パスにして解決した。
</p>

<p>
viewに埋め込んでいるので、別環境だと動かなかったりする。
</p>

<ul class="org-ul">
<li>localhost じか埋め込みなので、アドレス指定でアクセスしたとき動かないなど</li>
</ul>
</div>
</div>
<div id="outline-container-org41f250c" class="outline-3">
<h3 id="org41f250c"><a href="#org41f250c"><span class="done DONE">DONE</span> ブックマークでズーム率を保持する</a></h3>
<div class="outline-text-3" id="text-org41f250c">
<p>
上書きしてるのを直す。
</p>
</div>
</div>
<div id="outline-container-orgda960b6" class="outline-3">
<h3 id="orgda960b6"><a href="#orgda960b6"><span class="done DONE">DONE</span> ページ量を可視化する</a></h3>
<div class="outline-text-3" id="text-orgda960b6">
<p>
ゲージを作る。
</p>

<p>
更新が面倒。既存コードの複数ヶ所に埋め込むのが嫌だな。
</p>

<p>
いいフックがあった。
</p>

<div class="org-src-container">
<pre class="src src-javascript">document.addEventListener(<span class="org-string">"webviewerloaded"</span>, () =&gt; {
    PDFViewerApplication.initializedPromise.then(() =&gt; {
        PDFViewerApplication.eventBus.on(<span class="org-string">"pagechanging"</span>, (e) =&gt; {
            console.log(<span class="org-string">'pagechanging, from '</span> + e.previous + <span class="org-string">' to '</span> + e.pageNumber);
        });
    });
});
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdc08ef6" class="outline-3">
<h3 id="orgdc08ef6"><a href="#orgdc08ef6"><span class="done DONE">DONE</span> ページ移動でログ表示する</a></h3>
<div class="outline-text-3" id="text-orgdc08ef6">
<ul class="org-ul">
<li>かかった時間</li>
<li><a href="https://ics.media/entry/230530/">https://ics.media/entry/230530/</a> を参考にしてメッセージ表示した</li>
</ul>
</div>
</div>
<div id="outline-container-org5468211" class="outline-3">
<h3 id="org5468211"><a href="#org5468211"><span class="done DONE">DONE</span> ページごとに演出を入れる</a></h3>
<div class="outline-text-3" id="text-org5468211">
<p>
色を変えるようにした。
</p>

<ul class="org-ul">
<li>1ページごと</li>
<li>10ページごと</li>
<li>100ページごと</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
